# Working with Multiple Tables

In [3]:
# !docker stop mysql-container
# !docker start mysql-container
# !docker ps

In [1]:
import mysql.connector as sql 
import os 
from dotenv import load_dotenv
from sqlalchemy import create_engine

load_dotenv('/workspaces/IBM-DS-Course/.env')
user = os.getenv('USER')
password = os.getenv('PASSWORD')

In [2]:
host = 'localhost'
port = 3306
db = 'HR'

In [3]:
conn = sql.connect(
    host=host,
    user=user,
    password=password,
    port=port
)
cursor = conn.cursor()

In [4]:
use = f'USE {db}'
cursor.execute(use)

## Accessing multiple tables with sub-queries

Retrieve only the EMPLOYEES records corresponding to jobs in the JOBS table.

In [5]:
q1 = "SELECT * FROM EMPLOYEES WHERE JOB_ID IN (SELECT JOB_IDENT FROM JOBS);"
cursor.execute(q1)

In [6]:
output1=cursor.fetchall()
print(*[row for row in output1],sep='\n' )

('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2)
('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5)
('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5)
('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5)
('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2)
('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2)
('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7)
('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7)
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5)

Retrieve JOB information for employees earning over $70,000.

In [7]:
q2 = '''
SELECT 
    JOB_TITLE, 
    MIN_SALARY,
    MAX_SALARY,
    JOB_IDENT
FROM JOBS
WHERE JOB_IDENT IN 
    (
        SELECT 
            JOB_ID 
        FROM EMPLOYEES 
        where SALARY > 70000 );
        '''
cursor.execute(q2)

In [8]:
output2 = cursor.fetchall()
print(*[row for row in output2], sep='\n')

('Sr. Architect', 60000, 100000, 100)
('Sr. Software Developer', 60000, 80000, 200)
('Lead Architect', 70000, 100000, 600)

Retrieve only the EMPLOYEES records corresponding to jobs in the JOBS table.

In [9]:
q3= '''
SELECT *
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;
'''
cursor.execute(q3)

In [10]:
output3 = cursor.fetchall()
print(*[row for row in output3], sep='\n')

('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2, 100, 'Sr. Architect', 60000, 100000)
('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5, 200, 'Sr. Software Developer', 60000, 80000)
('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5, 300, 'Jr.Software Developer', 40000, 60000)
('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5, 400, 'Jr.Software Developer', 40000, 60000)
('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2, 500, 'Jr. Architect', 50000, 70000)
('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2, 600, 'Lead Architect', 70000, 100000)
('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7, 650, 'Jr. Designer', 60000, 70000)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7, 660, 'Jr. Designer', 60000, 70000)
('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7, 234, 'Sr. Designer', 70000, 90000)
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5, 220, 'Sr. Designer', 70000, 90000)

Redo the previous query using shorter aliases for table names.

Note that the tables in question can be assigned shorter aliases. This is especially helpful in cases where specific columns are to be accessed from different tables. The query would be modified to:

In [11]:
q4 = '''
SELECT *
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;
'''
cursor.execute(q4)

In [12]:
output4 = cursor.fetchall()
print(*[row for row in output4], sep='\n')

('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2, 100, 'Sr. Architect', 60000, 100000)
('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5, 200, 'Sr. Software Developer', 60000, 80000)
('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5, 300, 'Jr.Software Developer', 40000, 60000)
('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5, 400, 'Jr.Software Developer', 40000, 60000)
('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2, 500, 'Jr. Architect', 50000, 70000)
('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2, 600, 'Lead Architect', 70000, 100000)
('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7, 650, 'Jr. Designer', 60000, 70000)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7, 660, 'Jr. Designer', 60000, 70000)
('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7, 234, 'Sr. Designer', 70000, 90000)
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5, 220, 'Sr. Designer', 70000, 90000)

In the previous query, retrieve only the Employee ID, Name, and Job Title.
Notice that Job Title is a column of the JOBS table, and other details are coming from the EMPLOYEES table. The two tables will be joined on Job ID.

In [13]:
q5 = '''
SELECT 
    EMP_ID,
    F_NAME,
    L_NAME,
    JOB_TITLE
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;
'''
cursor.execute(q5)

In [14]:
output5 = cursor.fetchall()
print(*[row for row in output5], sep='\n')

('E1001', 'John', 'Thomas', 'Sr. Architect')
('E1002', 'Alice', 'James', 'Sr. Software Developer')
('E1003', 'Steve', 'Wells', 'Jr.Software Developer')
('E1004', 'Santosh', 'Kumar', 'Jr.Software Developer')
('E1005', 'Ahmed', 'Hussain', 'Jr. Architect')
('E1006', 'Nancy', 'Allen', 'Lead Architect')
('E1007', 'Mary', 'Thomas', 'Jr. Designer')
('E1008', 'Bharath', 'Gupta', 'Jr. Designer')
('E1009', 'Andrea', 'Jones', 'Sr. Designer')
('E1010', 'Ann', 'Jacob', 'Sr. Designer')

Redo the previous query, but specify the fully qualified column names with aliases in the SELECT clause.

The column names can also be prefixed with table aliases to keep track of where each column is coming from.

In [15]:
q6 = '''SELECT E.EMP_ID, E.F_NAME, E.L_NAME, J.JOB_TITLE
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;
'''
cursor.execute(q6)

In [16]:
output6 = cursor.fetchall()
print(*[row for row in output6], sep='\n')

('E1001', 'John', 'Thomas', 'Sr. Architect')
('E1002', 'Alice', 'James', 'Sr. Software Developer')
('E1003', 'Steve', 'Wells', 'Jr.Software Developer')
('E1004', 'Santosh', 'Kumar', 'Jr.Software Developer')
('E1005', 'Ahmed', 'Hussain', 'Jr. Architect')
('E1006', 'Nancy', 'Allen', 'Lead Architect')
('E1007', 'Mary', 'Thomas', 'Jr. Designer')
('E1008', 'Bharath', 'Gupta', 'Jr. Designer')
('E1009', 'Andrea', 'Jones', 'Sr. Designer')
('E1010', 'Ann', 'Jacob', 'Sr. Designer')

Practice problems
Retrieve only the list of employees whose JOB_TITLE is Jr. Designer.

a. Using sub-queries

In [17]:
p1 = '''SELECT *
FROM EMPLOYEES E
WHERE JOB_ID IN 
    (
        SELECT JOB_IDENT
        FROM JOBS 
        WHERE JOB_TITLE = "Jr. Designer"
        );
'''
cursor.execute(p1)

In [18]:
ans1 = cursor.fetchall()
print(*[row for row in ans1], sep='\n')

('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7)


b. Using Implicit Joins

In [20]:
p2 = '''
SELECT E.EMP_ID, E.F_NAME, E.L_NAME, J.JOB_TITLE
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT AND J.JOB_TITLE = "Jr. Designer";
'''
cursor.execute(p2)

In [21]:
ans2 = cursor.fetchall()
print(*[row for row in ans2], sep='\n')

('E1007', 'Mary', 'Thomas', 'Jr. Designer')
('E1008', 'Bharath', 'Gupta', 'Jr. Designer')


Retrieve JOB information and a list of employees whose birth year is after 1976.

a. Using sub-queries

In [22]:
p3 = '''SELECT *
FROM JOBS
WHERE JOB_IDENT IN 
(
    SELECT JOB_ID
    FROM EMPLOYEES
    WHERE YEAR(B_DATE)>1976 
    );'''
cursor.execute(p3)

In [23]:
ans3 = cursor.fetchall()
print(*[row for row in ans3], sep='\n')

(300, 'Jr.Software Developer', 40000, 60000)
(400, 'Jr.Software Developer', 40000, 60000)
(500, 'Jr. Architect', 50000, 70000)
(600, 'Lead Architect', 70000, 100000)
(660, 'Jr. Designer', 60000, 70000)
(234, 'Sr. Designer', 70000, 90000)
(220, 'Sr. Designer', 70000, 90000)


b. Using implicit join

In [24]:
p4 = '''SELECT *
FROM JOBS J, EMPLOYEES E
WHERE E.JOB_ID = J.JOB_IDENT AND YEAR(E.B_DATE)>1976;'''
cursor.execute(p4)

In [25]:
ans4 = cursor.fetchall()
print(*[row for row in ans4], sep='\n')

(300, 'Jr.Software Developer', 40000, 60000, 'E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5)
(400, 'Jr.Software Developer', 40000, 60000, 'E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5)
(500, 'Jr. Architect', 50000, 70000, 'E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2)
(600, 'Lead Architect', 70000, 100000, 'E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2)
(660, 'Jr. Designer', 60000, 70000, 'E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7)
(234, 'Sr. Designer', 70000, 90000, 'E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7)
(220, 'Sr. Designer', 70000, 90000, 'E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5)

In [26]:
conn.commit()
conn.close()